In [2]:
import pandas as pd
df = pd.read_csv('titanicd.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
target = df.Survived
inputs = df.drop('Survived',axis='columns')

In [5]:
dummies = pd.get_dummies(inputs.Sex)
dummies = dummies.astype(int)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [6]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [7]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [8]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [9]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [10]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [12]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(inputs,target,test_size=0.2)

In [13]:
len(X_train)

712

In [14]:
len(inputs)

891

In [15]:
X_train

     Pclass        Age     Fare  female  male
823       3  27.000000  12.4750       1     0
326       3  61.000000   6.2375       0     1
229       3  29.699118  25.4667       1     0
508       3  28.000000  22.5250       0     1
473       2  23.000000  13.7917       1     0
..      ...        ...      ...     ...   ...
886       2  27.000000  13.0000       0     1
515       1  47.000000  34.0208       0     1
381       3   1.000000  15.7417       1     0
218       1  32.000000  76.2917       1     0
67        3  19.000000   8.1583       0     1

[712 rows x 5 columns]

In [16]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [17]:
model.fit(X_train,y_train)

GaussianNB()

In [18]:
model.score(X_train,y_train)

0.7851123595505618

In [19]:
X_test[:10]

     Pclass        Age     Fare  female  male
588       3  22.000000   8.0500       0     1
222       3  51.000000   8.0500       0     1
392       3  28.000000   7.9250       0     1
797       3  31.000000   8.6833       1     0
888       3  29.699118  23.4500       1     0
762       3  20.000000   7.2292       0     1
540       1  36.000000  71.0000       1     0
475       1  29.699118  52.0000       0     1
207       3  26.000000  18.7875       0     1
611       3  29.699118   7.0500       0     1

In [20]:
y_test[:10]

588    0
222    0
392    0
797    1
888    0
762    1
540    1
475    0
207    1
611    0
Name: Survived, dtype: int64

In [21]:
model.predict(X_test[:10])

array([0, 0, 0, 1, 1, 0, 1, 0, 0, 0], dtype=int64)

In [22]:
model.predict_proba(X_test[:10])

array([[0.99109304, 0.00890696],
       [0.99001554, 0.00998446],
       [0.99163288, 0.00836712],
       [0.06364068, 0.93635932],
       [0.06187246, 0.93812754],
       [0.99078123, 0.00921877],
       [0.00219242, 0.99780758],
       [0.87951524, 0.12048476],
       [0.99151462, 0.00848538],
       [0.99168245, 0.00831755]])